set1 = {1, 2, 3, 4, 5}
set2 = {4, 5, 6, 7, 8}

set3 = set1 - set2
print(set3)

#Напишите программу, которая принимает два множества set1, set2
# и возвращает новое множество, содержащее элементы, которые есть в set1,
# но отсутствуют в set2.