set1 = {1, 2, 3, 4, 5}
set2 = {4, 5, 6, 7, 8}
print(set1.symmetric_difference(set2))


#Напишите программу, которая принимает два множества
# и возвращает новое множество, содержащее
# все уникальные элементы из обоих множеств. symmetric.difference
#set3 = set1.difference(set2)
#set4 = set2.difference(set1)
#print(set3, set4)