lst=[1, 2, 3, 4, 5, 5, 6]
set1 = set(lst)
print(set1)




#Напишите программу, которая принимает список lst и
# возвращает множество уникальных элементов из этого списка.