set1 = {1, 2, 3, 4, 5}
set2 = {4, 5, 6, 7, 8}

set3 = set1.intersection(set2)
print(set3)



#Напишите программу, которая принимает два множества и возвращает новое множество,
# содержащее только те элементы, которые присутствуют в обоих множествах.