colors = {"red" : 1 , "pink":  2, "green":  3}
colors["black"] = 4
print(colors)


#Напишите программу, которая добавляет новую пару ключ-значение в словарь.