colors = {"red" : 1 , "pink":  2, "green":  3}
colors.pop("pink")
print(colors)

#Напишите программу, которая удаляет пару ключ-значение из словаря по ключу.