colors = {"red" : 1 , "pink":  2, "green":  3}
a = "red"
if a in colors:
    print('есть')
else:
   print('нету')




#Напишите программу, которая проверяет, есть ли определенный ключ в словаре.


   #b = colors.get(a)
