colors = {"red" : 1 , "pink":  2, "green":  3}
keys = list(colors.keys())
print(keys)




#Напишите программу, которая выводит все ключи словаря.