colors = {"red" : 1 , "pink":  2, "green":  3}
print(colors.values())








#Напишите программу, которая выводит все значения словаря.