a = 'Hello world'
print(a.upper())











#Напишите программу, которая преобразует строку в верхний регистр.