a = 'Hello world'
print(a.startswith('Hello'))











#Напишите программу, которая проверяет,
# начинается ли строка с определенной подстроки.