a = 'Я люблю яблоки'
b = a.replace('яблоки','груши')
print(b)








#Напишите программу,
# которая заменяет все вхождения одной подстроки на другую в строке.