a = "hello , world"
print(a.split(","))


#Напишите программу,
# которая разбивает строку на список подстрок по определенному разделителю.