a = '   Hello, world   '
b = a.strip()
print(b)








#Напишите программу, которая удаляет лишние пробелы в начале и конце строки.