a = int(input('Введите a: '))
b = int(input('Введите b: '))
c = [i**2 for i in range(a, b + 1)]
print(c)




#Создать список квадратов чисел от a до b. a и b вводятся с клавиатуры.