a = ['green' , 'red' , 'black', 'pink', 'apple']
length = [len(i) for i in a if len(i) >=5]
print(length)


#Напишите выражение, которое преобразует
# список строк в список длин этих строк, игнорируя строки длиной менее 5 символов.
# for i in a
#if len i >=5: