print({i: i**2 for i in range(1,11) if i%2!=0})





#Создайте словарь, в котором ключами будут числа от 1 до 10,
# а значениями их квадраты, только для нечетных чисел.
#a = {}

#for i in range(1,11):
#    if i %2!=0:
#        a[i] = i**2
#print(a)