list1 = [1, 2, 3, 4, 5]
list2 = [4, 5, 6, 7, 8]
result= [i for i in list1 for n in list2 if i !=n]
print(result)



#Напишите выражение, которое объединяет значения из двух списков только
# в том случае, если они не равны друг другу.
#result =[]
#for i   in list1:
 #   for n in list2:
  #      if i != n:
   #         result.append(i)

#print(result)
