a = [i for i in range(1,100) if i % 3 == 0 and i % 5 == 0]
print(list(a))




#Создать список всех чисел от 1 до 100, которые делятся и на 3, и на 5.