print(['FOUR' if (i**3) % 4==0 else i**3 for i in range(1,11)])





# Создайте список из кубов чисел от 1 до 10,
# но если куб делится на 4, то вместо числа вставьте строку "FOUR".
#result=[]

#for i in range (1, 11):
#    cube = i**3
#    if cube %4 == 0:
#        result.append('FOUR')
#    else:
#        result.append(cube)
#print(result)