a =[[i*4+n+1 for n in range(4)] for i in range(3)]
print(a)




#Создать список состоящий из других списков,
# следующего вида:[[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]
#a =[]
#for i in range(3):
 #   b=[]
 #   for n in range(4):
  #      b.append(i*4+n+1)
 #       a.append(b)
#print(a)