range(1,10):
    print(i)




#Напишите программу, которая выводит на экран все числа от 1 до 10.