a = input('Введите слово: ')
b = a.replace('a' , '')
print(b)




#Напишите программу, которая запрашивает у пользователя слово,
# а затем выводит на экран все буквы этого слова, кроме буквы "а".