a = (input('Введите число: '))
b = a**2
print(b)
if a == 'exit':
    print('exit')
else:
    print('ничего')

name = input()
while name != “exit”:
    name = input()

#Напишите программу которая запрашивает у пользователя число и
# выводит квадрат этого числа, до тех пор, пока он не введет 'exit'.