a = int(input('Введите число n: '))
for i in range(1, a + 1):
     print(i)


#Напишите программу, которая запрашивает у пользователя число n,
# а затем выводит на экран все числа от 1 до n.