for i in range(2, 20, 2):
    print(i)



#Напишите программу, которая выводит на экран все четные числа от 2 до 20. (шаг 2 )