a = int(input('Введите число n: '))
for i in range(2, a+1, 2):
     print(i)



#Напишите программу, которая запрашивает у пользователя число n,
# а затем выводит на экран все четные числа от 2 до n.