for i in range(1,10):
    print(9*i)



#Напишите программу, которая выводит на экран таблицу умножения на 9.
# 9 × 1 = 9
#9 × 2 = 18
#9 × 3 = 27
#9 × 4 = 36
#9 × 5 = 45
#9 × 6 = 54
#9 × 7 = 63
#9 × 8 = 72
#9 × 9 = 81
