a = int(input('Введите число n: '))
for i in range(1,10):
    print(a*i)




#Напишите программу, которая запрашивает у пользователя число n,
# а затем выводит на экран таблицу умножения на n.