a = int(input('Введите число n: '))
for i in range(a, 0, -1):
    print(i)


#Напишите программу, которая запрашивает у пользователя число n,
# а затем выводит на экран все числа от n до 1 в обратном порядке. (