for i in range(26):
    print (chr(97+i), end = '')




#Напишите программу, которая выводит на экран все буквы английского алфавита.
# Рекомендую почитать про функцию chr() функция эта принимает целое число
# и возвращает символ, соответствующий этомому коду в таблице аски для англ алф
# 26 букв в англ алф аски табл от 65 до 90