a = input('Введите слово: ')
b = ''
for i in a:
   b=i+b
   print(b)



#Напишите программу, которая запрашивает у пользователя слово,
# а затем выводит на экран все буквы этого слова в обратном порядке.