a = input('Введите строку: ')
i = 0
c= 'a, b, c, d, f, g, h, j, k, l, m, n, p, q, r, s, t, v, w, x, y, z'
print(a.count(c))

for symbol in c
if symbol.isalpha() and symbol in c:
    i=+1

#Пользователь вводит строку. Посчитайте количество согласных букв в этой строке.