number = int(input("Введите номер месяца вашего рождения: "))

if number == 1:
    print("Вы родились в Январе. За окном падал белый снег.")
elif number == 2:
    print("Вы родились в Феврале. За окном падал белый снег.")
elif number == 3:
    print("Вы родились в Марте. Птицы пели прекрасные песни.")
elif number == 4:
    print("Вы родились в Апреле. Птицы пели прекрасные песни.")
elif number == 5:
    print("Вы родились в Мае. Птицы пели прекрасные песни.")
elif number == 6:
    print("Вы родились в Июне. Солнце светило ярче чем когда-либо.")
elif number == 7:
    print("Вы родились в Июле. Солнце светило ярче чем когда-либо.")
elif number == 8:
    print("Вы родились в Августе. Солнце светило ярче чем когда-либо.")
elif number == 9:
    print("Вы родились в Сентябре. Урожай был невероятным.")
elif number == 10:
    print("Вы родились в Октябре. Урожай был невероятным.")
elif number == 11:
    print("Вы родились в Ноябре. Урожай был невероятным.")
elif number == 12:
    print("Вы родились в Декабре. За окном падал белый снег.")
else:
    print("Неверный месяц")