a = input('Введите первое число: ')
b = input('Введите второе число: ')
c = input('Введите третье число: ')

if a + b > c:
    print('больше')
elif a + b < c:
    print('меньше')
else:
    print('равно')


#Напишите программу, принимающую три числа,
# третье число это приблизительная сумма первых двух,
# программа должна возвращать сообщения вида: "больше", "меньше" или "равно".
#сравнить сумму двух первых чисел с третьим
