a = input('Введите что-нибудь: ')

if a:
    print('True')
else:
    print('False')




#Напишите программу, которая просит пользователя что-нибудь ввести с клавиатуры.
# Если он вводит какие-нибудь данные, то на экране должно выводиться сообщение True.
# Если он не вводит данные, а просто нажимает Enter, то программа выводит False.
#print(bool(a))