a = 15
if a % 2 == 0:
    print("чётное")
else:
    print("нечётное")






#Есть число a = 15 ,
# напишите программу, которая определит является ли это число четным или нечетным.
#Число считается четным, если делится на 2 без остатка, равен нулю