a = 9
b = 90
c = 9

if a+b>c and a+c>b and b+c>a:
    print('возможен')
else:
    print("невозможен")


#sum суммирует

#Напишите программу, которая принимает три числа,
# определить, возможен ли треугольник с такими сторонами.