a = ['red' , 'green' , 'black']
b = ['yellow', 'blue', 'pink']
c = a + b
print(c)


#Напишите программу, которая объединяет два списка в один.