a = ['red' , 'green' , 'black']
a.append('white')
print(a)



#Напишите программу, которая добавляет элемент в конец списка.