a = ['red' , 'green' , 'black']
a.remove('green')
print(a)



#Напишите программу, которая удаляет элемент из списка по значению.