a = [2 ,9, 7, 5, 1,4]
a.sort()
print(a)


#Напишите программу, которая сортирует список по возрастанию.