a = ['red' , 'green' , 'black']
b = a.index('green')
print(b)




#Напишите программу, которая находит индекс первого вхождения элемента в списке.