a = 2
if a > 0:
    print('положительное')
elif a < 0:
    print('отрицательное')
else:
    print('ноль')




#Напишите программу,
# которая определяет, является ли число положительным, отрицательным или нулем.
