a = input('Введите символ: ')
if a.isupper():
       print('буква верхнего регистра')
elif a.islower():
       print('буква нижнего регистра')
else:
       print('не буква')


#Напишите программу,
# которая определяет, является ли введенный символ буквой верхнего или
# нижнего регистра.