a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
c = int(input('Введите третье число: '))

наименьшее = min(a,b,c)
print(наименьшее)

#Напишите программу,
# которая определяет наименьшее из трех чисел, введенных с клавиатуры.