a = input('Введите первую строку: ')
b = input('Введите вторую строку: ')

if len(a) == len(b):
    print('равны по количеству символов')
else:
    print('не равны по количеству символов')

#Напишите программу,
# которая сравнивает две строки и выводит сообщение о том,
# равны ли они по количеству символов или нет. лен получаем длину строки и сравниваем
