d = {'green': 1, 'blue': 2, 'red': 3}
max = max(d.values())

for k, v in d.items:

    print()



#key = max(d)
#print(key)

#Напишите программу, которая принимает словарь d, где ключами являются строки,
# а значениями — числа.
# Функция должна вернуть ключ, соответствующий максимальному значению.