d = {'green': 1, 'blue': 2, 'red': 3}
b= {v: k for k,v in d.items()}
print(b)


#Напишите программу, которая принимает словарь d и возвращает новый словарь,
# где ключи и значения поменяны местами.
# Предполагается, что значения уникальны и являются неизменяемыми типами данных.